# Pandas Indexing

In [1]:
import pandas as pd

In [11]:
dfdata = {'Name':['Zhang San','Li Si','Wang Laowu','Zhao Liu','Qian Qi','Sun Ba'],
        'Subject':['Literature','History','Enlish','Maths','Physics','Chemics'],
        'Score':[98,76,84,70,93,83]}
scoresheet = pd.DataFrame(dfdata, index=['No1', 'No2', 'No3', 'No4', 'No5', 'No6'])
scoresheet

           Name  Score     Subject
No1   Zhang San     98  Literature
No2       Li Si     76     History
No3  Wang Laowu     84      Enlish
No4    Zhao Liu     70       Maths
No5     Qian Qi     93     Physics
No6      Sun Ba     83     Chemics

In [44]:
scoresheet['Subject'] # 提取 Subject 列

No1    Literature
No2       History
No3        Enlish
No4         Maths
No5       Physics
No6       Chemics
Name: Subject, dtype: object

In [43]:
scoresheet.Subject

No1    Literature
No2       History
No3        Enlish
No4         Maths
No5       Physics
No6       Chemics
Name: Subject, dtype: object

In [38]:
scoresheet[['Subject']] # 提取列(这样返回的是 DataFrame， scoressheet['Subject']) 返回的是 Series

        Subject
No1  Literature
No2     History
No3      Enlish
No4       Maths
No5     Physics
No6     Chemics

In [34]:
# 提取多列
scoresheet[['Name', 'Score']]

           Name  Score
No1   Zhang San     98
No2       Li Si     76
No3  Wang Laowu     84
No4    Zhao Liu     70
No5     Qian Qi     93
No6      Sun Ba     83

In [39]:
# 切片提取的是行
scoresheet[:4]

           Name  Score     Subject
No1   Zhang San     98  Literature
No2       Li Si     76     History
No3  Wang Laowu     84      Enlish
No4    Zhao Liu     70       Maths

In [18]:
# 使用非整数切片时，包含末尾
# 注意提取的是行
scoresheet["No3":"No4"]

           Name  Score Subject
No3  Wang Laowu     84  Enlish
No4    Zhao Liu     70   Maths

In [23]:
scoresheet.loc[["No1", "No3", "No6"]] # 提取行

           Name  Score     Subject
No1   Zhang San     98  Literature
No3  Wang Laowu     84      Enlish
No6      Sun Ba     83     Chemics

In [24]:
scoresheet.loc[:, ["Score", 'Name']] # 提取列

     Score        Name
No1     98   Zhang San
No2     76       Li Si
No3     84  Wang Laowu
No4     70    Zhao Liu
No5     93     Qian Qi
No6     83      Sun Ba

In [22]:
scoresheet.loc[['No1', 'No3', 'No6'], ["Score", 'Name']] # 提取行列

     Score        Name
No1     98   Zhang San
No3     84  Wang Laowu
No6     83      Sun Ba

.iloc 和 .loc 的用法相同。只不过是用下标来进行切片

In [30]:
scoresheet.iloc[[0,2,5]]  # 第 1，3，6 行

           Name  Score     Subject
No1   Zhang San     98  Literature
No3  Wang Laowu     84      Enlish
No6      Sun Ba     83     Chemics

In [28]:
scoresheet.iloc[:, [1,2]] # 第 2，3 列

     Score     Subject
No1     98  Literature
No2     76     History
No3     84      Enlish
No4     70       Maths
No5     93     Physics
No6     83     Chemics

In [31]:
scoresheet.iloc[[0,2,5], [1,2]]

     Score     Subject
No1     98  Literature
No3     84      Enlish
No6     83     Chemics